# 可以在这里添加新的阴阳怪气, {}为昵称位置
Messages: list[list[str]] = [
    [  # lose negative solo
        '果皇套也不能让{}赢得比赛，真是太遗憾了',
        '{}被人按在地上摩擦, 输掉了这场比赛',
        '{}悲惨地输掉了比赛',
        '{}头都被打歪了, 心态爆炸地输掉了比赛.',
        '{}捕鱼被鱼吃了, 输掉了比赛.',
        '{}打的是个几把.',
        '果皇队友卡也不能让{}赢得比赛'
    ], [  # lose positive solo
        '{}无力回天输掉了比赛.',
        '{}尽力了, 但还是输了比赛.',
        '{}背靠世界树, 虽败犹荣.',
        '{}带不动队友, 输了比赛',
        '{}又输了, 很难受, 宁愿输的是我.',
    ], [  # win negative solo
        '{}侥幸赢得了比赛',
        '{}走狗屎运赢得了比赛',
        '{}躺赢了比赛',
        '{}打团都没来, 队友4V5赢得了比赛.',
        '{}使用了果皇队友卡，赢得比赛'
    ], [  # win positive solo
        '{}使用了果皇套，轻松带走对面',
        '{}带领团队走向了胜利',
        '{}暴打对面后赢得了胜利',
        '{}CARRY全场赢得了胜利',
        '{}把对面当猪宰了, 赢得了胜利.',
        '{}又赢了, 这游戏就是这么枯燥, 且乏味.',
    ], [  # lose negative party
        '{}被人按在地上摩擦, 输掉了这场比赛',
        '{}悲惨地输掉了比赛',
        '{}头都被打歪了, 心态爆炸地输掉了比赛.',
        '{}捕鱼被鱼吃了, 输掉了比赛.',
        '{}打的是个几把.',
        '{}又组团送分了'
    ], [  # lose positive party
        '{}无力回天输掉了比赛.',
        '{}尽力了, 但还是输了比赛.',
        '{}背靠世界树, 虽败犹荣.',
        '{}带不动队友, 输了比赛',
        '{}又输了, 很难受, 宁愿输的是我.',
    ], [  # win negative party
        '{}侥幸赢得了比赛',
        '{}走狗屎运赢得了比赛',
        '{}躺赢了比赛',
        '{}使用了果皇队友卡，赢得了比赛'
    ], [  # win positive party
        '{}带领团队走向了胜利',
        '{}暴打对面后赢得了胜利',
        '{}CARRY全场赢得了胜利',
        '{}把对面当猪宰了, 赢得了胜利.',
        '{}又赢了, 这游戏就是这么枯燥, 且乏味.',
    ]
]
